<a href="https://colab.research.google.com/github/julianovale/pythonparatodos/blob/main/M%C3%B3dulo04Aula08.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [8]:
import pandas as pd

In [9]:
dados_hist = {'Empresa 1': [4,9,6],'Empresa 2': [9,6,4]}
dados_hist

{'Empresa 1': [4, 9, 6], 'Empresa 2': [9, 6, 4]}

In [10]:
dfh = pd.DataFrame(dados_hist)
dfh

   Empresa 1  Empresa 2
0          4          9
1          9          6
2          6          4

In [11]:
dados_dia = pd.Series([5,15],index=['Empresa 1','Empresa 2'])
print(dados_dia)

Empresa 1     5
Empresa 2    15
dtype: int64

In [12]:
nova_linha = pd.DataFrame([dados_dia],index=[3])
nova_linha

   Empresa 1  Empresa 2
3          5         15

In [13]:
dfh = pd.concat([dfh, nova_linha])
dfh

   Empresa 1  Empresa 2
0          4          9
1          9          6
2          6          4
3          5         15